init-v2.org
#+STARTUP: overview
** 模块化配置
*** early-init.el
在 init.el 配置之前加载
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
;;; early-init.el --- Early initialization. -*- lexical-binding: t -*-

;;; Commentary:
;;
;; Emacs 27 introduces early-init.el, which is run before init.el,
;; before package and UI initialization happens.
;;

;;; Code:

;; Defer garbage collection further back in the startup process
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Package initialize occurs automatically, before `user-init-file' is
;; loaded, but after `early-init-file'. We handle package
;; initialization, so we must prevent Emacs from doing it early!
(setq package-enable-at-startup nil)

;; Prevent unwanted runtime compilation for gccemacs (native-comp) users;
;; packages are compiled ahead-of-time when they are installed and site files
;; are compiled when gccemacs is installed.
(setq native-comp-deferred-compilation nil)

;; Inhibit resizing frame
(setq frame-inhibit-implied-resize t)

;; Faster to disable these here (before they've been initialized)
;; (push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
(when (featurep 'ns)
  (push '(ns-transparent-titlebar . t) default-frame-alist))

(add-to-list 'initial-frame-alist '(fullscreen . maximized))
;; full screen emacs cannot work here, call toggle fullscreen in init. 

;; Resizing the Emacs frame can be a terribly expensive part of changing the
;; font. By inhibiting this, we easily halve startup times with fonts that are
;; larger than the system default.
(setq frame-inhibit-implied-resize t)

(provide 'early-init)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; early-init.el ends here
  
#+end_src
*** init.el
init.el 保持最小配置，其他功能都拆分到独立文件。
加载 lisp directory path，在 init.el 里面添加:
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/init.el
  ;; -*- coding: utf-8; lexical-binding: t; -*-

  ;; open for debug error when you need.
  ;;(setq debug-on-error t)

;; A big contributor to startup times is garbage collection. We up the gc
;; threshold to temporarily prevent it from running, and then reset it by the
;; `gcmh' package.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.6)


(let ((dir (locate-user-emacs-file "lisp")))
  (add-to-list 'load-path (file-name-as-directory dir)))  

(setq custom-file (locate-user-emacs-file "custom.el"))
(load custom-file 'no-error 'no-message)  
 
(require 'init-begin)
(require 'init-package)
(require 'init-evil)
(require 'init-basic)
(require 'init-completion)
;;使用内置的 tab-bar 在 init-window 配置 
;(require 'init-awesome-tab)

(require 'init-search)
(require 'init-ui)
(require 'init-org)
(require 'init-text-manipulation)
(require 'init-window)
(require 'init-tabs)
(require 'init-dev)
(require 'init-git)
(require 'init-python)  

(provide 'init)

;;; init.el ends here

#+END_SRC
*** init-begin.el
#+begin_src  emacs-lisp :tangle ~/.emacs.d/lisp/init-begin.el
  ;; -*- coding: utf-8; lexical-binding: t; -*-

  ;; hidden menu-bar tool-bar scroll-bar, not nil ,not negative, specially apply in client mode.

  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; full screen emacs
  (toggle-frame-fullscreen)
  (provide 'init-begin)
#+end_src
*** init-packages.el
package 配置
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-package.el
;; -*- coding: utf-8; lexical-binding: t; -*-

(require 'package)
    (setq package-archives '(("gnu"   . "https://mirrors.163.com/elpa/gnu/")
			     ("melpa" . "https://mirrors.163.com/elpa/melpa/")))
    ;; add nongnu resource
    (add-to-list 'package-archives
		 (cons "nongnu" (format "http%s://elpa.nongnu.org/nongnu/"
					(if (gnutls-available-p) "s" ""))))
(package-initialize)


;;防止反复调用 package-refresh-contents 会影响加载速度
(when (not package-archive-contents)
      (package-refresh-contents))


;;; 安装最新 org 需要，这个配置一定要配置在 use-package 的初始化之前，否则无法正常安装
;;(assq-delete-all 'org package--builtins)
;;(assq-delete-all 'org package--builtin-versions)


;; Bootstrap `use-package'
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  (setq use-package-always-ensure nil)
  (setq use-package-always-defer nil)
  (setq use-package-always-demand nil)
  (setq use-package-expand-minimally nil)
  (setq use-package-enable-imenu-support t))
(eval-when-compile
  (require 'use-package))

;; Bootstrap `quelpa'.
(use-package quelpa
  :ensure t
  :commands quelpa
  :custom
  (quelpa-git-clone-depth 1)
  (quelpa-self-upgrade-p nil)
  (quelpa-update-melpa-p nil)
  (quelpa-checkout-melpa-p nil))

(unless (package-installed-p 'quelpa-use-package)
      (quelpa
       '(quelpa-use-package
	 :fetcher git
	 :url "https://github.com/quelpa/quelpa-use-package.git")))

(use-package quelpa-use-package
      :init
      (setq quelpa-use-package-inhibit-loading-quelpa t)
      :demand t)

(provide 'init-package)

#+END_SRC

