init-v2.org
*** init-basic.el
查看 emacs 的帮助可以：
C-h k 寻找快捷键的帮助信息
C-h v 寻找变量的帮助信息
C-h f 寻找函数的帮助信息

Emacs 常见符号的意义如下：
M(eta)：统一改到 option 键
s(uper)：统一改到 command 键
S(Shift)：不用修改
C(trl)：统一改成 Caps Lock

光标的移动在编辑器里面最为常见，必须熟练使用这些操作。
C-f 为前移一个字符， f 代表 forward。
C-b 为后移一个字符， b 代表 backward。
C-p 为上移至前一行， p 代表 previous。
C-n 为上移至下一行， n 代表 next。
C-a 为移至行首， a 代表 ahead。
C-e 为移至行尾， e 代表 end。

M-<	Go to beginning of file
M->	Go to end of file

在整个Mac系统都内置了这些快捷键。在很多应用里也是。
把mac的几个常用操作配置到Emacs里面。

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-basic.el
    ;; -*- lexical-binding: t -*-


;; Suppress GUI features and more
(setq use-file-dialog nil
      use-dialog-box nil
      inhibit-x-resources t
      inhibit-default-init t
      inhibit-startup-screen t
      inhibit-startup-message t
      inhibit-startup-buffer-menu t)

;; Pixelwise resize
(setq window-resize-pixelwise t
      frame-resize-pixelwise t)

;; Linux specific
(setq x-gtk-use-system-tooltips nil
      x-gtk-use-native-input t
      x-underline-at-descent-line t)

;; With GPG 2.1+, this forces gpg-agent to use the Emacs minibuffer to prompt
;; for the key passphrase.
(setq epg-pinentry-mode 'loopback)

    ;; emacs >= 26  开启行号可以这么设置
    (display-line-numbers-mode 1)

    ;; 关闭工具栏，tool-bar-mode 即为一个 Minor Mode
    (tool-bar-mode -1)
    ;; 关闭文件滑动控件
    (scroll-bar-mode -1)
    ;; 更改光标的样式
    (setq-default cursor-type 'bar)

    ;;不再需要，下面有更好的补全插件
    ;;(icomplete-mode 1)

    ;; 快速打开配置文件
    (defun open-init-file()
      (interactive)
      (find-file "~/.emacs.d/init-v2.org"))
    ;; 这一行代码，将函数 open-init-file 绑定到 <f2> 键上
    (global-set-key (kbd "<f2>") 'open-init-file)

    ;; 更改显示字体大小 16pt
    ;; http://stackoverflow.com/questions/294664/how-to-set-the-font-size-in-emacs
    (set-face-attribute 'default nil :height 170);;

    ;;让鼠标滚动更好用
    (setq mouse-wheel-scroll-amount '(1 ((shift) . 1) ((control) . nil)))
    (setq mouse-wheel-progressive-speed nil)

    ;; orgmode 进行文学编程的时候， < 会匹配 ) 导致影响匹配的高亮提示
    ;; 参见 https://www.reddit.com/r/orgmode/comments/s869jc/matching_parentheses_in_orgmode/
    ;; 可以使用 org-edit-special 在 minibuffer 里面进行 code 的校验
    ;;括号匹配高亮
    (show-paren-mode t)
    ;;自动补全成对的符号
    (electric-pair-mode 1)

    ;;禁止自动生成备份文件
    (setq make-backup-files nil)
    ;;禁止在文件末尾添加一个换行符
    (setq require-final-newline nil)

;; No lock files
(setq create-lockfiles nil)

;; Always load the newest file
(setq load-prefer-newer t)

;; Cutting and pasting use primary/clipboard
(setq select-enable-primary t
      select-enable-clipboard t)

;; No gc for font caches
(setq inhibit-compacting-font-caches t)

;; Improve display
(setq display-raw-bytes-as-hex t
      redisplay-skip-fontification-on-input t)

;; No eyes distraction
(setq blink-cursor-mode nil)

;; The nano style for truncated long lines.
(setq auto-hscroll-mode 'current-line)

;; Treats the `_' as a word constituent
(add-hook 'after-change-major-mode-hook
          (lambda ()
            (modify-syntax-entry ?_ "w")))

;; No tabs
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)

;; Sane defaults
(setq use-short-answers t)
;; Inhibit switching out from `y-or-n-p' and `read-char-choice'
(setq y-or-n-p-use-read-key t
      read-char-choice-use-read-key t)

;; Enable the disabled dired commands
(put 'dired-find-alternate-file 'disabled nil)



    ;;最近打开文件
    (require 'recentf)
    (recentf-mode 1)
    (setq recentf-max-menu-item 8)
    (global-set-key (kbd "C-x b") 'consult-buffer)

    (delete-selection-mode 1)

    ;;高亮当前行
    (global-hl-line-mode 1)

    ;; 自动加载在外部修改的文件
    (global-auto-revert-mode 1)

    ;; close auto save
    (setq auto-save-default nil)
    ;;关闭错误的时候哔哔的警告声音
    (setq ring-bell-function 'ignore)
    ;; simple to y or n
    (fset 'yes-or-no-p 'y-or-n-p)

    (setq inhibit-splash-screen t)
    (setq initial-scratch-message ";; Happy Hacking! Emacs loves you!")



    ;; mac option key ->  meta
    ;; mac commad key -> super
    (setq mac-option-modifier 'meta
	  mac-command-modifier 'super)

    (global-set-key (kbd "s-a") 'mark-whole-buffer) ;;对应Windows上面的Ctrl-a 全选
    (global-set-key (kbd "s-c") 'kill-ring-save) ;;对应Windows上面的Ctrl-c 复制
    (global-set-key (kbd "s-s") 'save-buffer) ;; 对应Windows上面的Ctrl-s 保存
    (global-set-key (kbd "s-v") 'yank) ;对应Windows上面的Ctrl-v 粘贴
    (global-set-key (kbd "s-z") 'undo) ;对应Windows上面的Ctrol-z 撤销
    (global-set-key (kbd "s-x") 'kill-region) ;对应Windows上面的Ctrol-x 剪切


    ;;内置 package
    ;;保存命令历史，在emacs重启之后，能够智能提示最近的操作命令，否则重启之后都清空了
    (use-package savehist
      :hook (after-init . savehist-mode)
      :init (setq enable-recursive-minibuffers t ; Allow commands in minibuffers
		history-length 1000
		savehist-additional-variables '(mark-ring
						global-mark-ring
						search-ring
						regexp-search-ring
						extended-command-history)
		savehist-autosave-interval 300)
    )

  ;; MacOS specific
  (use-package exec-path-from-shell
    :ensure t
    :when (eq system-type 'darwin)
    :hook (after-init . exec-path-from-shell-initialize))

  ;; 重启命令
  (use-package restart-emacs
     :ensure t)


    ;;内置package
    (use-package saveplace
      :hook (after-init . save-place-mode))

  ;; Workaround with minified source files
  (use-package so-long
    :ensure nil
    :hook (after-init . global-so-long-mode))  


  (use-package general
    :ensure t
    :init
    (with-eval-after-load 'evil
      (general-add-hook 'after-init-hook
			(lambda (&rest _)
			  (when-let ((messages-buffer (get-buffer "*Messages*")))
			    (with-current-buffer messages-buffer
			      (evil-normalize-keymaps))))
			nil
			nil
			t))


    (general-create-definer global-definer
      :keymaps 'override
      :states '(insert emacs normal hybrid motion visual operator)
      :prefix "SPC"
      :non-normal-prefix "C-SPC")

    (defmacro +general-global-menu! (name infix-key &rest body)
      "Create a definer named +general-global-NAME wrapping global-definer.
  Create prefix map: +general-global-NAME. Prefix bindings in BODY with INFIX-KEY."
      (declare (indent 2))
      `(progn
	 (general-create-definer ,(intern (concat "+general-global-" name))
	   :wrapping global-definer
	   :prefix-map ',(intern (concat "+general-global-" name "-map"))
	   :infix ,infix-key
	   :wk-full-keys nil
	   "" '(:ignore t :which-key ,name))
	 (,(intern (concat "+general-global-" name))
	  ,@body)))

    (general-create-definer global-leader
      :keymaps 'override
      :states '(emacs normal hybrid motion visual operator)
      :prefix ","
      "" '(:ignore t :which-key (lambda (arg) `(,(cadr (split-string (car arg) " ")) . ,(replace-regexp-in-string "-mode$" "" (symbol-name major-mode)))))))




    (provide 'init-basic)


#+END_SRC
*** init-completion.el
company config
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
;; -*- coding: utf-8; lexical-binding: t; -*-

  (use-package company
    :ensure t
    :bind (:map company-active-map
		("C-n" . 'company-select-next)
		("C-p" . 'company-select-previous))
    :init
    (global-company-mode t)
    :config
    (setq company-minimum-prefix-length 1)
    (setq company-idle-delay 0))


#+END_SRC

vertico config
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
  ;;增强 minibuffer 补全
  (use-package vertico :ensure	t)
  (vertico-mode t)

  ;; make c-j/c-k work in vertico selection
  (define-key vertico-map (kbd "C-j") 'vertico-next)
  (define-key vertico-map (kbd "C-k") 'vertico-previous)


#+END_SRC

orderless config
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
  ;;在 minibuffer 支持模糊搜索
  (use-package orderless :ensure t)
  (setq completion-styles '(orderless))

#+END_SRC

marginalia config
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
  ;; 增强 minibuffer 的annotation
  (use-package marginalia :ensure t)
  (marginalia-mode t)

#+END_SRC

embark config
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
  ;; minibuffer action 就类似于在任何内容上右键点击
  (use-package embark :ensure t)
  (global-set-key (kbd "C-;") 'embark-act)
  ;;利用这个 可以不用再记忆快捷键，只需要执行 C-x C-h 呼出帮助命令
  ;;然后输入想执行命令的关键字，既可以出现提示列表，又因为 orderless
  ;; 可以不用在意关键字单词的顺序 最后直接回车执行即可
  (setq prefix-help-command 'embark-prefix-help-command)

#+END_SRC

consult config

增强 consult 和 embark ，强大的文件夹内搜索大杀器
使用 consult-ripgrep 命令可以调用 ripgrep 搜索目标目录。

consult-ripgrep 可以搜索当前目录下所有文件内容，而且给出一个候选列表。
这时候按 C-c C-e 调用 embark-export-write 函数，将候选列表写入一下可写 buffer，
这时候再按 M-x query-replace-regexp 则可以交互式替换文本内容。 按 y 则执行替换，按 n 跳过
最后 C-x C-s 保存所有替换结果。
这个功能可以替换 ivy 插件。

consult-find 可以搜索当前目录下所有文件内容。
C-c p f 查找 project 下的指定文件
consult-recent-file 列出最近使用文件.


#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el
  ;;增强文件内搜索和跳转函数定义
  (use-package consult :ensure t)
  ;;同时使用需要这个
  (use-package embark-consult :ensure t)
  ;;强大的文件内搜索功能，完全替代了 swiper 插件
  (global-set-key (kbd "C-s") 'consult-line)
  ;;文件内函数跳转
  ;;consult-imenu

  ;; consult 默认配置优化
  (eval-after-load 'consult
  (progn
    (setq
     consult-narrow-key "<"
     consult-line-numbers-widen t
     consult-async-min-input 2
     consult-async-refresh-delay  0.15
     consult-async-input-throttle 0.2
     consult-async-input-debounce 0.1)
    ))


#+END_SRC

使用 Emacs 打开文件管理器
M-x consult-directory-externally 然后输入文件目录，既可以用系统文件浏览器打开该目录
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-completion.el

  (defun consult-directory-externally (file)
    "Open FILE externally using the default application of the system."
    (interactive "fOpen externally: ")
    (if (and (eq system-type 'windows-nt)
	     (fboundp 'w32-shell-execute))
	(shell-command-to-string (encode-coding-string
				  (replace-regexp-in-string "/" "\\\\"
				    (format "explorer.exe %s"
					    (file-name-directory
					  (expand-file-name file)))) 'gbk))
      (call-process (pcase system-type
		      ('darwin "open")
		      ('cygwin "cygstart")
		      (_ "xdg-open"))
		    nil 0 nil
		    (file-name-directory (expand-file-name file)))))
  ;; 给 embark 添加一个 action: E 使用系统的文件浏览器打开当前目录
  ;; https://github.com/oantolin/embark/tree/fcf068c0e912baa9267cbec02e56a5972d8f31b4#creating-your-own-keymaps
  (eval-after-load 'embark
    (defvar-keymap embark-file-map "E" #'consult-directory-externally))
  ;;打开当前文件的目录
  (defun my-open-current-directory ()
    (interactive)
    (consult-directory-externally default-directory))



  (provide 'init-completion)
#+END_SRC

*** init-search.el
增强 consult 和 embark ，强大的文件夹内搜索大杀器
使用 consult-ripgrep 命令可以调用 ripgrep 搜索目标目录。

consult-ripgrep 可以搜索当前目录下所有文件内容，而且给出一个候选列表。
这时候按 C-c C-e 调用 embark-export-write 函数，将候选列表写入一下可写 buffer，
这时候再按 M-x query-replace-regexp 则可以交互式替换文本内容。 按 y 则执行替换，按 n 跳过
最后 C-x C-s 保存所有替换结果。
这个功能可以替换 ivy 插件。


#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-search.el
 ;; -*- coding: utf-8; lexical-binding: t; -*-

  (use-package embark-consult :ensure t)
  (use-package wgrep :ensure t)
  (setq wgrep-auto-save-buffer t)

  (eval-after-load
      'consult
    '(eval-after-load
	 'embark
       '(progn
	  (require 'embark-consult)
	  (add-hook
	   'embark-collect-mode-hook
	   #'consult-preview-at-point-mode))))

  (defun embark-export-write ()
  "Export the current vertico results to a writable buffer if possible.
  Supports exporting consult-grep to wgrep, file to wdeired, and consult-location to occur-edit"
  (interactive)
  (require 'embark)
  (require 'wgrep)
  (pcase-let ((`(,type . ,candidates)
	       (run-hook-with-args-until-success 'embark-candidate-collectors)))
    (pcase type
      ('consult-grep (let ((embark-after-export-hook #'wgrep-change-to-wgrep-mode))
		       (embark-export)))
      ('file (let ((embark-after-export-hook #'wdired-change-to-wdired-mode))
	       (embark-export)))
      ('consult-location (let ((embark-after-export-hook #'occur-edit-mode))
			   (embark-export)))
      (x (user-error "embark category %S doesn't support writable export" x)))))

  (define-key minibuffer-local-map (kbd "C-c C-e") 'embark-export-write)


  (provide 'init-search)
#+END_SRC	  

