init-v2.org
*** init-ui.el
#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-ui.el
  ;; -*- lexical-binding: t -*-

  ;; install theme
  ;;(use-package gruvbox-theme :ensure t)
  ;;(load-theme 'gruvbox-light-soft t)


  ;; Use default theme in terminals
  (use-package doom-themes
      :ensure t
      :when (display-graphic-p)
      :config
      (load-theme 'doom-one t)
      (doom-themes-org-config))

    (use-package emacs
      :ensure nil
      :unless (display-graphic-p)
      :config
      (load-theme 'leuven t))


   (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode)
    :custom
    (doom-modeline-irc nil)
    (doom-modeline-mu4e nil)
    (doom-modeline-gnus nil)
    (doom-modeline-github nil)
    (doom-modeline-persp-name nil)
    (doom-modeline-unicode-fallback t)
    (doom-modeline-enable-word-count nil))

  (use-package simple
	:ensure nil
	:hook (after-init . size-indication-mode)
	:init
	(progn
	  (setq column-number-mode t)
	  ))

  ;; M-x nerd-icons-install-fonts 安装必要的字体，否则有些字符不显示
  (use-package nerd-icons
	:ensure t
	;; :custom
	;; The Nerd Font you want to use in GUI
	;; "Symbols Nerd Font Mono" is the default and is recommended
	;; but you can use any other Nerd Font if you want
	;; (nerd-icons-font-family "Symbols Nerd Font Mono")
	:when (display-graphic-p)
	:demand t
	)

  (use-package visual-fill-column
	:ensure t
	:init
	(add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
	;; Configure fill width
	(setq visual-fill-column-center-text t))

(use-package dashboard
  :ensure t
  :init
  ;; Format: "(icon title help action face prefix suffix)"
  (setq dashboard-navigator-buttons `(((,(if (fboundp 'nerd-icons-octicon) (nerd-icons-octicon "nf-oct-mark_github") "★")
                                        "GitHub" "Browse" (lambda (&rest _) (browse-url homepage-url)))
                                       (,(if (fboundp 'nerd-icons-octicon) (nerd-icons-octicon "nf-oct-heart") "♥")
                                        "Stars" "Show stars" (lambda (&rest _) (browse-url stars-url)))
                                       (,(if (fboundp 'nerd-icons-octicon) (nerd-icons-octicon "nf-oct-alert") "⚑")
                                        "Issue" "Report issue" (lambda (&rest _) (browse-url issue-url)) warning)
                                       (,(if (fboundp 'nerd-icons-octicon) (nerd-icons-octicon "nf-oct-download") "♺")
                                        "Upgrade" "Upgrade packages synchronously" (lambda (&rest _) (package-upgrade-all nil)) success))))
  (dashboard-setup-startup-hook)
  :config
  (defconst homepage-url "https://github.com/zongwu233/emacs.d.v2")
  (defconst stars-url (concat homepage-url "/stargazers"))
  (defconst issue-url (concat homepage-url "/issues/new"))
  :custom
  (dashboard-startup-banner 'logo)
  (dashboard-set-heading-icons t)
  (dashboard-set-file-icons t)
  (dashboard-set-init-info t)
  (dashboard-set-navigator t)
  (dashboard-items '((recents   . 10)
                     (projects  . 7))))
 

  (provide 'init-ui)

#+END_SRC
*** init-org.el
**** org TODO
每日计划 daily routine 比如
    Daily Routine [%]
     - [ ] coding
     - [ ] reading
     - [ ] exercise
在 Daily Routine 上按 C-c C-s 选择日期，输入具体时间，并且在生成的时间后面添加 1d,可以使得 checklist 设置每日自动生成。
通过勾选checklist 完成所以的任务，然后使用 C-c C-t 标记今天日程完成，那么 SCHEDULED 会自动把日期 +1
但是 checklist 还是已经勾选了，使用 org-checklist package, 然后在 Daily Routine 按 M-x org-set-properties, 为日程设置属性
:RESET_CHECK_BOXES: true
就可以自动更新为未勾选的 checklist

同时设置 org-log-done 可以将已经完成的日程收到完成的列表: LOGBOOK ，支持收缩和展开

**** org agenda
**** org capture
**** 配置
C-RET  for creating new headlines
M-RET  for creating new lists
M-left/right/up/down


在 Emacs 的 org-mode 中，当你在代码块（即 #+BEGIN_SRC 和 #+END_SRC 之间）内按下回车键时，
org-mode 会尝试维护代码块的一致缩进。这在某些情境下可能是希望的行为，但在其他情况下可能是不期望的。
要防止这种自动缩进，你可以做以下操作：
使用 M-x 打开命令行输入。
输入 customize-variable 并回车。
输入 org-src-preserve-indentation 并回车。
将该变量设置为 t（即 true），这意味着当你编辑代码块时，org-mode 将不会再自动改变其原始的缩进。
保存并应用更改。
这样，org-mode 在编辑源代码块时将保持原始的缩进，并且按回车键时不会引入任何额外的缩进。
另外，还有一个变量叫 org-edit-src-content-indentation，
它控制 org-mode 编辑源代码时默认的缩进量。如果你仍然遇到问题，可以考虑检查这个变量的值是否为0。
如果不是，你可以将其设置为0，这样当编辑源代码块时就不会有任何额外的缩进了。

#+BEGIN_SRC emacs-lisp  :tangle ~/.emacs.d/lisp/init-org.el
    ;;安装最新版本 org 不使用内置版本
    (use-package org
      :pin gnu
      :ensure t)

    (use-package org-contrib
      :pin nongnu
      :ensure t
      :after org
      (require 'org-checklist))

    (require 'org-tempo)  ;开启easy template

    ;; 需要开启 electric-pair-mode
    ;; 禁用左尖括号
    (setq electric-pair-inhibit-predicate
	  `(lambda (c)
	     (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))

    (add-hook 'org-mode-hook
	      (lambda ()
		(setq-local electric-pair-inhibit-predicate
			    `(lambda (c)
			       (if (char-equal c ?\<) t (,electric-pair-inhibit-predicate c))))))
    ;; 更丰富的 TODO 状态
    (setq org-todo-keywords
	(quote ((sequence "TODO(t)" "STARTED(s)" "|" "DONE(d!/!)")
		(sequence "WAITING(w@/!)" "SOMEDAY(S)" "|" "CANCELLED(c@/!)" "MEETING(m)" "PHONE(p)"))))

    ;; need repeat task and properties
    (setq org-log-done t)
    (setq org-log-into-drawer t)

    ;; C-c C-s schedule
    ;; C-c C-d deadline
    (global-set-key (kbd "C-c a") 'org-agenda)
    (setq org-agenda-files '("~/org/gtd.org"))
    (setq org-agenda-span 'day)

    ;; see https://github.com/abo-abo/org-download/issues/131
    (use-package org-download
    :ensure t
    :after org
    :config
    (setq-default
     org-download-image-dir "~/org/images"
     ;; Basename setting seems to be simply ignored.
     org-download-screenshot-basename ".png"
     org-download-timestamp "org_%Y%m%d-%H%M%S_"
     org-image-actual-width 960
     org-download-heading-lvl nil)
    :custom
    (org-download-screenshot-method
     (cond
      ((eq system-type 'gnu/linux)
       "xclip -selection clipboard -t image/png -o > '%s'")
      ((eq system-type 'darwin)
       "pngpaste %s")))
    :bind
    (:map org-mode-map
	  (("C-M-y" . org-download-screenshot)
	   ("s-y" . org-download-yank))))  

    ;; Drag-and-drop to `dired`
    (add-hook 'dired-mode-hook 'org-download-enable)

  (defun org-apperance-evil-hack ()
    (add-hook 'evil-insert-state-entry-hook #'org-appear-manual-start nil t)
    (add-hook 'evil-insert-state-exit-hook #'org-appear-manual-stop nil t))

  (use-package org-appear
    :ensure t
    :after org
    :hook (org-mode . org-appear-mode)
    :init
    (setq org-appear-trigger 'manual)
    (add-hook 'org-mode-hook 'org-apperance-evil-hack))
  (use-package org-superstar
    :ensure t
    :after org
    :hook (org-mode . org-superstar-mode)
    :config
    (setq org-superstar-special-todo-items t))
  (use-package evil-org
    :ensure t
    :hook (org-mode . evil-org-mode)
    :after org
    :config
    (setq evil-want-C-i-jump nil)
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))  

    (provide 'init-org)
#+END_SRC

*** use-package
use-package 实际上是一个宏，更好的取代 require 的方式，该宏允许你以一种既面向性能又整洁的方式隔离文件中的包配置。
更安全的 require ，如果加载 package 失败，require 会终止整个程序，而 use-pacakge 则只是在 message 中给出警告。
如果 package 不存在，则安装 package （使用 ensure 关键字）。
集中化配置，use-pacage 支持 init,config,autoload,bind 等关键字，方便管理加载包过程中的一些配置。
init 的代码在包加载之前执行，config 代码在包加载后执行，commands 可以在真正需要这个包时再加载, 提高启动速度, 避免无谓的 require.
bind 用于绑定快捷键。
use-package 在 Emacs29 已经内置。
*** init-evil.el
#+begin_src emacs-lisp  :tangle ~/.emacs.d/lisp/init-evil.el
  (use-package evil
    :ensure t
    :init
    ;; 不使用 evil 自带的 keybinding 
    (setq evil-want-keybinding nil)
    ;; 使用 vim 的 C-u 滚动界面操作
    ;; C-d C-u 向前翻页 向后翻页
    (setq evil-want-C-u-scroll t)
    ;; C-i 导致 orgmode 的 src 文件输入回车的时候，src 内容自动缩进了， orgmode 的C-i 就是缩进。
    ;;https://jeffkreeftmeijer.com/emacs-evil-org-tab/
    (setq evil-want-C-i-jump nil)
    (evil-mode)

    ;; https://emacs.stackexchange.com/questions/46371/how-can-i-get-ret-to-follow-org-mode-links-when-using-evil-mode
    (with-eval-after-load 'evil-maps
      (define-key evil-motion-state-map (kbd "RET") nil))

    ;; insert state 不使用 vi keybinding
    (setcdr evil-insert-state-map nil)
    (define-key evil-insert-state-map [escape] 'evil-normal-state)

    (define-key evil-normal-state-map (kbd "[ SPC") (lambda () (interactive) (evil-insert-newline-above) (forward-line)))
    (define-key evil-normal-state-map (kbd "] SPC") (lambda () (interactive) (evil-insert-newline-below) (forward-line -1)))


    (define-key evil-normal-state-map (kbd "[ b") 'previous-buffer)
    (define-key evil-normal-state-map (kbd "] b") 'next-buffer)
    (define-key evil-motion-state-map (kbd "[ b") 'previous-buffer)
    (define-key evil-motion-state-map (kbd "] b") 'next-buffer)

    (evil-define-key 'normal dired-mode-map
      (kbd "<RET>") 'dired-find-alternate-file
      (kbd "C-k") 'dired-up-directory
      "`" 'dired-open-term
      "q" 'quit-window
      "o" 'dired-find-file-other-window
      ")" 'dired-omit-mode)


    )

  ;; 支持 vim 的 redo undo ，而且更强大
  ;; u undo  C-r redo
  (use-package undo-tree
    :ensure t
    :diminish
    :init
    (global-undo-tree-mode 1)
    (setq undo-tree-auto-save-history nil)
    (evil-set-undo-system 'undo-tree))

  ;;文本搜索  doom modeline 会显示结果总数以及当前 index
  (use-package evil-anzu
    :ensure t
    :after evil
    :diminish
    :demand t
    :init
    (global-anzu-mode t))

  ;;社区更统一的定义各种常用 mode 下的 evil state
  (use-package evil-collection
    :ensure t
    :demand t
    :config
    (setq evil-collection-mode-list (remove 'lispy evil-collection-mode-list))
    (evil-collection-init)

    (cl-loop for (mode . state) in
	     '((org-agenda-mode . normal)
	       (Custom-mode . emacs)
	       (eshell-mode . emacs)
	       (org-mode . emacs)
	       (makey-key-mode . motion))
	     do (evil-set-initial-state mode state)))

  ;; vim surround plugin
  (use-package evil-surround
    :ensure t
    :init
    (global-evil-surround-mode 1))

  (use-package evil-nerd-commenter
    :ensure t
    :init
    (define-key evil-normal-state-map (kbd ",/") 'evilnc-comment-or-uncomment-lines)
    (define-key evil-visual-state-map (kbd ",/") 'evilnc-comment-or-uncomment-lines)
    )
  (use-package evil-snipe
    :ensure t
    :diminish
    :init
    (evil-snipe-mode +1)
    (evil-snipe-override-mode +1))

  ;; 按 % 跳转到匹配的符号，比如 () {} 甚至 begin end
  (use-package evil-matchit
    :ensure
    :init
    (global-evil-matchit-mode 1))

  ;; emacs 也有 multicusor 但是类 vim 的这个 iedit 操作更符合 vim 习惯
  ;; 在 normal 模式按 vim 选择当前 word，按 R 则会选择文本中所有的该 word
  ;; 此时可以按 gg 或者 G 跳转到匹配的 word 第一个 或者最后一个
  ;; 或者 0 $ 跳转到 word 的第一个单词/最后一个单词
  (use-package iedit
    :ensure t
    :init
    (setq iedit-toggle-key-default nil)
    :config
    (define-key iedit-mode-keymap (kbd "M-h") 'iedit-restrict-function)
    (define-key iedit-mode-keymap (kbd "M-i") 'iedit-restrict-current-line))

  (use-package evil-multiedit
    :ensure t
    :commands (evil-multiedit-default-keybinds)
    :init
    (evil-multiedit-default-keybinds))



  (provide 'init-evil)
#+end_src


vi 的各种模式 mode ，在 evil 中称为 state。
normal state 
insert state
emacs state 排除所有的 vi binding 回到 Emacs 的默认行为，通过 C-z 切换。
visual state
motion state 对只读 buffer 的一种模式。只能 motion 不能修改。
replace state 与 insert state 类似，除了是 replace 而不是 insert 。
operator-pending state
*** init-text-manipulation.el
强大的文本区域选择
而且支持将选择之后的文本，传输给其他命令，比如 搜索，高亮，替换 等等。
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-text-manipulation.el

;; -*- lexical-binding: t -*-

  (defun my/search-project-for-symbol-at-point ()
      (interactive)
      (if (use-region-p)
	  (progn
	    (consult-ripgrep (project-root (project-current))
			     (buffer-substring (region-beginning) (region-end))))))

      (defun my/evil-quick-replace (beg end )
      (interactive "r")
      (when (evil-visual-state-p)
	(evil-exit-visual-state)
	(let ((selection (regexp-quote (buffer-substring-no-properties beg end))))
	  (setq command-string (format "%%s /%s//g" selection))
	  (minibuffer-with-setup-hook
	      (lambda () (backward-char 2))
	    (evil-ex command-string)))))

      (define-key evil-visual-state-map (kbd "C-r") 'my/evil-quick-replace)


      (use-package expand-region
      :ensure t
      :bind ("C-=" . er/expand-region)
      :config
      (defadvice er/prepare-for-more-expansions-internal
	  (around helm-ag/prepare-for-more-expansions-internal activate)
	ad-do-it
	(let ((new-msg (concat (car ad-return-value)
			       ", H to highlight in buffers"
			       ", / to search in project, "
			       "e iedit mode in functions, "
			       "f to search in files, "
			       "b to search in opened buffers"))
	      (new-bindings (cdr ad-return-value)))
	  (cl-pushnew
	   '("H" (lambda ()
		   (interactive)
		   (call-interactively
		    'my/highlight-dwim)))
	   new-bindings)
	  (cl-pushnew
	   '("/" (lambda ()
		   (interactive)
		   (call-interactively
		    'my/search-project-for-symbol-at-point)))
	   new-bindings)
	  (cl-pushnew
	   '("e" (lambda ()
		   (interactive)
		   (call-interactively
		    'evil-multiedit-match-all)))
	   new-bindings)
	  (cl-pushnew
	   '("f" (lambda ()
		   (interactive)
		   (call-interactively
		    'find-file)))
	   new-bindings)
	  (cl-pushnew
	   '("b" (lambda ()
		   (interactive)
		   (call-interactively
		    'consult-line)))
	   new-bindings)
	  (setq ad-return-value (cons new-msg new-bindings)))))


      (defun my/highlight-dwim ()
      (interactive)
      (if (use-region-p)
	  (progn
	    (highlight-frame-toggle)
	    (deactivate-mark))
	(symbol-overlay-put)))



    (use-package symbol-overlay
      :ensure t
      :config
      (define-key symbol-overlay-map (kbd "h") 'nil))

    (use-package highlight-global
      :ensure nil
      :commands (highlight-frame-toggle)
      :quelpa (highlight-global :fetcher github :repo "glen-dai/highlight-global")
      :config
      (progn
	(setq-default highlight-faces
		      '(('hi-red-b . 0)
			('hi-aquamarine . 0)
			('hi-pink . 0)
			('hi-blue-b . 0)))))
    (defun my/clear-highlight ()
      (interactive)
      (clear-highlight-frame) ;; highlight-global function
      (symbol-overlay-remove-all))


    (provide 'init-text-manipulation)

#+end_src

