init-v2.org
*** init-window.el 
窗口管理
evil 模式，在 normal state 按 :vsp vertical split 垂直分割窗口
在当前的不同窗口切换光标  C-w h/j
按 :sp 则是默认上下分割窗口
按 C-x 1 关闭其他窗口
Emacs 有很多插件用来管理窗口
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-window.el
  ;; 默认竖直拆分窗口，Emcas 叫 horizontal split 
  (setq split-width-threshold 1 )
  ;;Enable window-numbering-mode and use M-1 through M-0 to navigate.
  (use-package window-numbering
	  :init
	  :ensure t
	  :hook (after-init . window-numbering-mode))


    ;; buf-move-left right up down 
    (use-package buffer-move
	:ensure t)

    ;; M-x resize-window 然后再按下面的命令
    (use-package resize-window
      :ensure t
      :init
      (defvar resize-window-dispatch-alist
	'((?n resize-window--enlarge-down " Resize - Expand down" t)
	  (?p resize-window--enlarge-up " Resize - Expand up" t)
	  (?f resize-window--enlarge-horizontally " Resize - horizontally" t)
	  (?b resize-window--shrink-horizontally " Resize - shrink horizontally" t)
	  (?r resize-window--reset-windows " Resize - reset window layout" nil)
	  (?w resize-window--cycle-window-positive " Resize - cycle window" nil)
	  (?W resize-window--cycle-window-negative " Resize - cycle window" nil)
	  (?2 split-window-below " Split window horizontally" nil)
	  (?3 split-window-right " Slit window vertically" nil)
	  (?0 resize-window--delete-window " Delete window" nil)
	  (?K resize-window--kill-other-windows " Kill other windows (save state)" nil)
	  (?y resize-window--restore-windows " (when state) Restore window configuration" nil)
	  (?? resize-window--display-menu " Resize - display menu" nil))
	"List of actions for `resize-window-dispatch-default.
    Main data structure of the dispatcher with the form:
    \(char function documentation match-capitals\)"))

  ;; -*- lexical-binding: t -*-

  ;; build-in package
  ;; window 操作的 redo undo  
  (use-package winner
    :ensure nil
    :commands (winner-undo winner-redo)
    :hook (after-init . winner-mode)
    :init (setq winner-boring-buffers '("*Completions*"
					"*Compile-Log*"
					"*inferior-lisp*"
					"*Fuzzy Completions*"
					"*Apropos*"
					"*Help*"
					"*cvs*"
					"*Buffer List*"
					"*Ibuffer*"
					"*esh command on file*")))


  ;;buffers 重要程度不一样，有一些 buffer 很重要，比如主要工作区域。有一些 buffer 是暂时性的，比如日志，消息
  ;;有一些buffer很重要但只是时不时需要用一下， 比如 REPL  Shell Docs 不需要一直展示
  ;; popper 就是将所有的 buffer 分类管理，分成 regular 和 popups ，对 popups 有着丰富强大的管理
  (use-package popper
  :ensure t
  :defines popper-echo-dispatch-actions
  :commands popper-group-by-directory
  :bind (:map popper-mode-map
	      ("s-`" . popper-toggle-latest)
	      ("s-o"   . popper-cycle)
	      ("M-`" . popper-toggle-type))
  :hook (emacs-startup . popper-mode)
  :init
  (setq popper-reference-buffers
	'("\\*Messages\\*"
	  "Output\\*$" "\\*Pp Eval Output\\*$"
	  "\\*Compile-Log\\*"
	  "\\*Completions\\*"
	  "\\*Warnings\\*"
	  "\\*Flymake diagnostics.*\\*"
	  "\\*Async Shell Command\\*"
	  "\\*Apropos\\*"
	  "\\*Backtrace\\*"
	  "\\*prodigy\\*"
	  "\\*Calendar\\*"
	  "\\*Embark Actions\\*"
	  "\\*Finder\\*"
	  "\\*Kill Ring\\*"
	  "\\*Embark Export:.*\\*"
	  "\\*Edit Annotation.*\\*"
	  "\\*Flutter\\*"
	  bookmark-bmenu-mode
	  lsp-bridge-ref-mode
	  comint-mode
	  compilation-mode
	  help-mode helpful-mode
	  tabulated-list-mode
	  Buffer-menu-mode
	  occur-mode
	  gnus-article-mode devdocs-mode
	  grep-mode occur-mode rg-mode deadgrep-mode ag-mode pt-mode
	  ivy-occur-mode ivy-occur-grep-mode
	  process-menu-mode list-environment-mode cargo-process-mode
	  youdao-dictionary-mode osx-dictionary-mode fanyi-mode

	  "^\\*eshell.*\\*.*$" eshell-mode
	  "^\\*shell.*\\*.*$"  shell-mode
	  "^\\*terminal.*\\*.*$" term-mode
	  "^\\*vterm.*\\*.*$"  vterm-mode

	  "\\*DAP Templates\\*$" dap-server-log-mode
	  "\\*ELP Profiling Restuls\\*" profiler-report-mode
	  "\\*Flycheck errors\\*$" " \\*Flycheck checker\\*$"
	  "\\*Paradox Report\\*$" "\\*package update results\\*$" "\\*Package-Lint\\*$"
	  "\\*[Wo]*Man.*\\*$"
	  "\\*ert\\*$" overseer-buffer-mode
	  "\\*gud-debug\\*$"
	  "\\*lsp-help\\*$" "\\*lsp session\\*$"
	  "\\*quickrun\\*$"
	  "\\*tldr\\*$"
	  "\\*vc-.*\\*$"
	  "\\*eldoc\\*"
	  "^\\*elfeed-entry\\*$"
	  "^\\*macro expansion\\**"

	  "\\*Agenda Commands\\*" "\\*Org Select\\*" "\\*Capture\\*" "^CAPTURE-.*\\.org*"
	  "\\*Gofmt Errors\\*$" "\\*Go Test\\*$" godoc-mode
	  "\\*docker-containers\\*" "\\*docker-images\\*" "\\*docker-networks\\*" "\\*docker-volumes\\*"
	  "\\*prolog\\*" inferior-python-mode inf-ruby-mode swift-repl-mode
	  "\\*rustfmt\\*$" rustic-compilation-mode rustic-cargo-clippy-mode
	  rustic-cargo-outdated-mode rustic-cargo-test-mode))



  (setq popper-echo-dispatch-actions t)
  (setq popper-group-function nil)
  :config
  (popper-echo-mode 1)

  (with-no-warnings
    (defun my-popper-fit-window-height (win)
      "Determine the height of popup window WIN by fitting it to the buffer's content."
      (fit-window-to-buffer
       win
       (floor (frame-height) 3)
       (floor (frame-height) 3)))
    (setq popper-window-height #'my-popper-fit-window-height)

    (defun popper-close-window-hack (&rest _)
      "Close popper window via `C-g'."
      ;; `C-g' can deactivate region
      (when (and (called-interactively-p 'interactive)
		 (not (region-active-p))
		 popper-open-popup-alist)
	(let ((window (caar popper-open-popup-alist)))
	  (when (window-live-p window)
	    (delete-window window)))))
    (advice-add #'keyboard-quit :before #'popper-close-window-hack)))





    (provide 'init-window)
#+end_src

*** init-tabs.el
use build-in tab-bar
use tabspace
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-tabs.el

  ;; Windows layout recorder
  ;;
  ;; You can still use `winner-mode' on Emacs 26 or early. On Emacs 27, it's
  ;; preferred over `winner-mode' for better compatibility with `tab-bar-mode'.
  (use-package tab-bar
    :ensure nil
    :init  (tab-bar-mode t)
    ;; 图标太丑了
    ;;:hook (after-init . tab-bar-history-mode)
    :custom
    (tabbar-use-images nil)
    (tab-bar-new-button-show nil)
    (tab-bar-close-button-show nil)
    (tab-bar-new-tab-choice "*scratch*")
    (tab-bar-tab-hints t)
   )

  (use-package tabspaces
    :ensure t
    :hook (after-init . tabspaces-mode) ;; use this only if you want the minor-mode loaded at startup.
    :commands (tabspaces-switch-or-create-workspace
	       tabspaces-open-or-create-project-and-workspace)
    :custom
    (tabspaces-use-filtered-buffers-as-default t)
    (tabspaces-default-tab "Default")
    (tabspaces-remove-to-default t)
    (tabspaces-include-buffers '("*scratch*"))
    ;; maybe slow 
    ;;(tabspaces-session t)
    ;;(tabspaces-session-auto-restore t)
    :config
    ;; Filter Buffers for Consult-Buffer

    (with-eval-after-load 'consult
      ;; hide full buffer list (still available with "b" prefix)
      (consult-customize consult--source-buffer :hidden nil :default nil)
      ;; set consult-workspace buffer list
      (defvar consult--source-workspace
	(list :name "Workspace Buffers"
	      :narrow ?w
	      :history 'buffer-name-history
	      :category 'buffer
	      :state #'consult--buffer-state
	      :default t
	      :items (lambda () (consult--buffer-query
				 :predicate #'tabspaces--local-buffer-p
				 :sort 'visibility
				 :as #'buffer-name)))

	"Set workspace buffer list for consult-buffer.")
      (add-to-list 'consult-buffer-sources 'consult--source-workspace)))


    (provide 'init-tabs)
#+end_src
