init-v2.org
*** init-dev.el
#+begin_src  emacs-lisp :tangle ~/.emacs.d/lisp/init-dev.el

;; Project management
(use-package projectile
  :ensure t
  :hook (after-init . projectile-mode)
  :bind (:map projectile-mode-map
         ("C-c p" . projectile-command-map))
  :config
  (dolist (dir '("bazel-bin"
                 "bazel-out"
                 "bazel-testlogs"))
    (add-to-list 'projectile-globally-ignored-directories dir))
  :custom
  (projectile-use-git-grep t)
  (projectile-indexing-method 'alien)
  (projectile-kill-buffers-filter 'kill-only-files)
  ;; Ignore uninteresting files. It has no effect when using alien mode.
  (projectile-globally-ignored-files '("TAGS" "tags" ".DS_Store"))
  (projectile-globally-ignored-file-suffixes '(".elc" ".pyc" ".o" ".swp" ".so" ".a"))
  (projectile-ignored-projects `("~/"
                                 "/tmp/"
                                 "/private/tmp/"
                                 ,package-user-dir)))

#+end_src

programming config

tree-sitter is an Emacs binding for Tree-sitter, an incremental parsing system.

It aims to be the foundation for a new breed of Emacs packages that understand code structurally. For example:
Faster, fine-grained code highlighting.
More flexible code folding.
Structural editing (like Paredit, or even better) for non-Lisp code.
More informative indexing for imenu.
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-dev.el

    ;; emacs29 内置 tree-sitter 
    ;; 安装所有 tree-sitter langs libs : M-x treesit-auto-install-all   
    (use-package treesit-auto
      :demand t
      :ensure t
      :init (setq treesit-font-lock-level 4)
      :config
      (setq treesit-auto-install 'prompt)
      (global-treesit-auto-mode))

    ;;查找定义和引用
    ;; xref-find-definitions   M-.
    ;; xref-find-references    M-?
    ;; xref-go-back            M-,
    ;; xref-go-forward         C-M-,


    ;; 使用 consult-imenu 列出文件内函数列表，方便跳转


  (defun my-eglot-keybindgs ()
    (define-key evil-motion-state-map "gR" #'eglot-rename)
    (define-key evil-motion-state-map "gr" #'xref-find-references)
    (define-key evil-normal-state-map "gi" #'eglot-find-implementation)
    (define-key evil-motion-state-map "gh" #'eldoc)
    (define-key evil-normal-state-map "ga" #'eglot-code-actions))
  ;; emacs29 内置 eglot:A client for Language Server Protocol servers
  ;; lsp-mode 集成了很多包，功能丰富， eglot 功能相对简单
  (use-package eglot
    :ensure nil
    :init
    (advice-add 'eglot-ensure :after 'my-eglot-keybindgs)
    :bind (:map eglot-mode-map
		("C-c l a" . eglot-code-actions)
		("C-c l r" . eglot-rename)
		("C-c l o" . eglot-code-action-organize-imports)
		("C-c l f" . eglot-format)
		("C-c l d" . eldoc)
		("s-<return>" . eglot-code-actions))
    :hook
    (css-mode . eglot-ensure)
    (js2-mode . eglot-ensure)
    (js-mode . eglot-ensure)
    (web-mode . eglot-ensure)
    (rust-mode . eglot-ensure)
    (elixir-mode . eglot-ensure)
    (c++-mode . eglot-ensure)
    (python-mode . eglot-ensure)

    :config
    (setq eglot-send-changes-idle-time 0.2)
    ;(add-to-list 'eglot-server-programs '(rust-mode "rust-analyzer"))
    ;(add-to-list 'eglot-server-programs '(c++-mode . ("clangd" "--enable-config")))
    (add-to-list 'eglot-server-programs '(web-mode . ("vscode-html-language-server" "--stdio")))
    ;(add-to-list 'eglot-server-programs '(elixir-mode "~/.emacs.d/elixir-ls/release/language_server.sh"))

  (setq read-process-output-max (* 1024 1024))
  (push :documentHighlightProvider eglot-ignored-server-capabilities)
  (setq eldoc-echo-area-use-multiline-p nil))

  (use-package consult-eglot
    :ensure t
    :defer t)


    (use-package yasnippet
    :ensure t
    :hook ((prog-mode . yas-minor-mode)
	   (org-mode . yas-minor-mode))
    :init
    :config
    (progn
      (setq hippie-expand-try-functions-list
	    '(yas/hippie-try-expand
	      try-complete-file-name-partially
	      try-expand-all-abbrevs
	      try-expand-dabbrev
	      try-expand-dabbrev-all-buffers
	      try-expand-dabbrev-from-kill
	      try-complete-lisp-symbol-partially
	      try-complete-lisp-symbol))))

    (use-package yasnippet-snippets
    :ensure t
    :after yasnippet) 

  (provide 'init-dev)

#+end_src
*** init-git.el
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-git.el
;;; init-git.el  -*- lexical-binding: t -*-
;; git-messenger has been superseded by {C-x v h} (`vc-region-history')
;;
;; Explicit binding makes it load lazily although it's the default.
;; See `magit-define-global-key-bindings' for more information.
(use-package magit
  :ensure t
  ;:hook (git-commit-setup . git-commit-turn-on-flyspell)
  :bind (("C-x g"   . magit-status)
         ("C-x M-g" . magit-dispatch)
         ("C-c M-g" . magit-file-dispatch))
  :custom
  (magit-diff-refine-hunk t)
  (magit-diff-paint-whitespace nil)
  (magit-ediff-dwim-show-on-hunks t))

;; NOTE: `diff-hl' depends on `vc'
(use-package vc
  :ensure nil
  :custom
  (vc-follow-symlinks t)
  (vc-allow-async-revert t)
  (vc-handled-backends '(Git)))

;; Highlight uncommitted changes using VC
(use-package diff-hl
  :ensure t
  :hook ((after-init         . global-diff-hl-mode)
         (dired-mode         . diff-hl-dired-mode-unless-remote)
         (magit-pre-refresh  . diff-hl-magit-pre-refresh)
         (magit-post-refresh . diff-hl-magit-post-refresh))
  :config
  ;; When Emacs runs in terminal, show the indicators in margin instead.
  (unless (display-graphic-p)
    (diff-hl-margin-mode)))

;; Visual diff interface
(use-package ediff
  :ensure nil
  ;; Restore window config after quitting ediff
  :hook ((ediff-before-setup . ediff-save-window-conf)
         (ediff-quit         . ediff-restore-window-conf))
  :config
  (defvar local-ediff-saved-window-conf nil)

  (defun ediff-save-window-conf ()
    (setq local-ediff-saved-window-conf (current-window-configuration)))

  (defun ediff-restore-window-conf ()
    (when (window-configuration-p local-ediff-saved-window-conf)
      (set-window-configuration local-ediff-saved-window-conf)))
  :custom
  (ediff-highlight-all-diffs t)
  (ediff-window-setup-function 'ediff-setup-windows-plain)
  (ediff-split-window-function 'split-window-horizontally)
  (ediff-merge-split-window-function 'split-window-horizontally))

;; Setup gitignore mode
(use-package conf-mode
  :ensure nil
  :mode (("\\.gitignore\\'"     . conf-unix-mode)
         ("\\.gitconfig\\'"     . conf-unix-mode)
         ("\\.gitattributes\\'" . conf-unix-mode)))

(provide 'init-git)

;;; init-git.el ends here
#+end_src
*** init-python.el
#+begin_src emacs-lisp :tangle ~/.emacs.d/lisp/init-python.el
  ;;; init-python.el  -*- lexical-binding: t -*-

  ;; Python Mode
  ;; Install: pip install pyflakes autopep8
  (use-package python
    :ensure t
    :hook (inferior-python-mode . (lambda ()
				    (process-query-on-exit-flag
				     (get-process "Python"))))
    :init
    ;; Disable readline based native completion
    (setq python-shell-completion-native-enable nil)
    :config
    (global-leader
      :major-modes
      '(python-mode t)
      ;;and the keymaps:
      :keymaps
      '(python-mode-map)
      "e" 'live-py-set-version)
    (setq python-shell-interpreter "python3"))

    ;; Live Coding in Python
    (use-package live-py-mode :ensure t)
  
    (provide 'init-python)
#+end_src
